#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
module.auth.aws_iam_user.terraform: Refreshing state... [id=terraform]
module.auth.aws_iam_group.ci: Refreshing state... [id=ci]
module.log.aws_elasticsearch_domain.stockviva-logs: Refreshing state... [id=arn:aws:es:ap-southeast-1:604533679009:domain/stockviva-logs]
module.auth.aws_iam_group_policy_attachment.ci: Refreshing state... [id=ci-20210208101935432400000001]
module.auth.aws_iam_user_group_membership.terraform: Refreshing state... [id=terraform-20210208082712576600000001]
module.auth.aws_iam_access_key.terraform: Refreshing state... [id=AKIAYZQID4OQ552VO3EO]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.test-bucket will be created
  + resource "aws_s3_bucket" "test-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "test-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```
</details>
*Pusher: @hosiukeung, Action: `pull_request`*